In [ ]:
%load_ext sql

In [ ]:
%%sql
SELECT *
FROM raw_data.user_session_channel
LIMIT 10

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(1651, '0004289ee1c7b8b08c77e19878106ae3', 'Organic'),
 (1197, '00053f5e11d1fe4e49a221165b39abc9', 'Facebook'),
 (1401, '00056c20eb5a029583db75506953f1d9', 'Facebook'),
 (1399, '00063cb5da1826febf178b669eea3250', 'Facebook'),
 (1667, '000958fdaefe0dd06f5d7c4e4a5f28d1', 'Instagram'),
 (468, '000a3f777828d2cdbee98887561aa130', 'Facebook'),
 (1563, '000cb7efa8a05429dd5309b4bea2eb0c', 'Naver'),
 (711, '00106ac9184e7d54b570d0f0cb0c38b2', 'Organic'),
 (473, '0011df6282fe8cf78feeab676fbc3c27', 'Naver'),
 (420, '00126b47d5502dfb7d01f750ad23d813', 'Facebook')]

In [ ]:
%%sql
SELECT COUNT(*)
FROM raw_data.session_timestamp

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

In [ ]:
# 일별 세션 수
%%sql
SELECT DATE(st.ts), COUNT(usc.userid)
FROM raw_data.session_timestamp st,
JOIN raw_data.user_session_channel usc
ON st.sessionid = usc.sessionid
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

In [ ]:
# 월별 세션 수
%%sql
SELECT TO_CHAR(st.ts, 'YYYY-MM') AS ym, COUNT(usc.userid)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc
ON st.sessionid = usc.sessionid
GROUP BY 1
ORDER BY 1

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 6261),
 ('2019-06', 10520),
 ('2019-07', 14840),
 ('2019-08', 17151),
 ('2019-09', 15790),
 ('2019-10', 18899),
 ('2019-11', 18059)]

In [ ]:
###### MAU 카운트
%%sql
SELECT TO_CHAR(st.ts, 'YYYY-MM') AS month, COUNT(DISTINCT usc.userid) AS mau
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc
ON st.sessionid = usc.sessionid
GROUP BY 1
ORDER BY 1
LIMIT 100

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 281),
 ('2019-06', 459),
 ('2019-07', 623),
 ('2019-08', 662),
 ('2019-09', 639),
 ('2019-10', 763),
 ('2019-11', 721)]